Info about table schema in postgreSQL

SELECT *
FROM information_schema.columns
WHERE table_schema = 'public'
AND table_name = 'photos';

You are designing a database for a book publishing company.  The database needs to store a table of authors and books. An author has many books.  This means that books should have a foreign key column that references an author.

Write a query that will join together these two tables.  For each book, print the title of the book and the name of the author.

CREATE TABLE authors (
    id SERIAL PRIMARY KEY,
    name VARCHAR(100)
);

CREATE TABLE books (
    id SERIAL PRIMARY KEY,
    title VARCHAR(100),
    author_id INTEGER REFERENCES authors(id)
);

SELECT title, name FROM books 
JOIN authors ON books.author_id = authors.id;

You are still authoring a database for a book publisher.  The database has a table of authors and a table of books .

Write a query that will return the title of each book, along with the name of the author.  All authors should be included, even if they do not have a book associated with them.

SELECT title, name FROM authors as a
LEFT JOIN books as b on a.id = b.author_id;

or

SELECT title, name FROM books as b
RIGHT JOIN authors as a on a.id = b.author_id;

Hmmm...I wonder if any authors are writing their own reviews for books! You are working with a database of books, authors, and reviews

Write a query that will return the title of each book, along with the name of the author, and the rating of a review.  Only show rows where the author of the book is also the author of the review.

CREATE TABLE books (
    id SERIAL PRIMARY KEY,
    title VARCHAR(50),
    author_id INTEGER REFERENCES authors(author_id) ON DELETE SET NULL
);

CREATE TABLE authors (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50)
);

CREATE TABLE reviews (
    id SERIAL PRIMARY KEY,
    rating INTEGER,
    reviewer_id INTEGER REFERENCES authors(author_id) ON DELETE CASCADE
);

SELECT b.title, a.name, r.rating FROM books as b
JOIN authors as a ON b.author_id = a.id 
JOIN reviews as r ON r.book_id = b.id 
AND r.reviewer_id = b.author_id;

or 

SELECT b.title, a.name, r.rating FROM books as b
JOIN authors as a ON b.author_id = a.id 
JOIN reviews as r ON r.book_id = b.id 
WHERE r.reviewer_id = b.author_id;

Write a query that will print an author's id and the number of books they have authored.

SELECT author_id, COUNT(*)
FROM books GROUP BY author_id;

Write a query that will print an author's name and the number of books they have authored.

SELECT a.name, COUNT(*) FROM books AS b
JOIN authors AS a ON b.author_id = a.id
GROUP BY b.author_id, a.name;

You are trying to find the phone manufacturers with the greatest revenue from selling phones.

Given a table of phones, print the names of manufacturers and total revenue (price * units_sold) for all phones.  Only print the manufacturers who have revenue greater than 2,000,000 for all the phones they sold.

CREATE TABLE phones (
    id SERIAL PRIMARY KEY,
    name VARCHAR (50),
    manufacturer VARCHAR (50),
    price INTEGER,
    units_sold INTEGER
);

SELECT manufacturer, SUM(price*units_sold) AS total_revenue
FROM phones 
GROUP BY manufacturer
HAVING SUM(price*units_sold) > 2000000;

Let's get more familiar with the E-Commerce dataset.
Write a query to print the number of paid and unpaid orders.

SELECT paid, COUNT(*) AS payment_status 
FROM orders AS o
GROUP BY paid;

Write a query that will print the manufacturer of phones where the phone's price is less than 170.  Also print all manufacturer that have created more than two phones.

IMPORTANT: You don't need to wrap each query with parenthesis! Your solution should not have any parens in it.

SELECT manufacturer FROM phones
WHERE price < 170

UNION 

SELECT manufacturer FROM phones
GROUP BY manufacturer 
HAVING COUNT(*) > 2;

Write a query that prints the name and price for each phone.  In addition, print out the ratio of the phones price against max price of all phones (so price / max price).  Rename this third column to price_ratio